// Ex.5
#include <iostream>
using namespace std;
int main()
{
	setlocale(0, "RUS");
	cout << " Вывести фигуры с заданной стороной\n" << "\n";
	cout << " Введите значение стороны (нечётное число):\n";
	int n;
	cin >> n;

	for (int y = 0; y < n; y++)
	{
		for (int x = 0; x < n; x++)
		{
			if ((y == 0 && x < n) || (x == 0 && y < n) ||
				(x == n - 1 && y < n) || (y == n - 1 && x < n) ||
				x == y)
				cout << "*";
			else
				cout << " ";
		}
		cout << "\n";
	}
	cout << "\n";
		/////////////////////////////////////////////////////////
	for (int y = 0; y < n; y++)
	{
		for (int x = 0; x < n; x++)
		{
			if ((y == 0 && x < n) || (x == 0 && y < n) ||
				(x == n - 1 && y < n) || (y == n - 1 && x < n) ||
				x + y == n - 1)
				cout << "*";
			else
				cout << " ";
		}
		cout << "\n";
	}
	cout << "\n";
	     //////////////////////////////////////////////////////////
	for (int y = 0; y < n; y++)
	{
		for (int x = 0; x < n; x++)
		{
			if ((y == 0 && x < n) || (x == 0 && y < n) ||
				(x == n - 1 && y < n) || (y == n - 1 && x < n) ||
				x == n / 2)
				cout << "*";
			else
				cout << " ";
		}
		cout << "\n";
	}
	cout << "\n";
		///////////////////////////////////////////////////////////
	for (int y = 0; y < n; y++)
	{
		for (int x = 0; x < n; x++)
		{
			if ((y == 0 && x < n) || (x == 0 && y < n) ||
				(x == n - 1 && y < n) || (y == n - 1 && x < n) ||
				y == n / 2)
				cout << "*";
			else
				cout << " ";
		}
		cout << "\n";
	}
	cout << "\n";
	///////////////////////////////////////////////////////////
	for (int y = 0; y < n; y++)
	{
		for (int x = 0; x < n; x++)
		{
			if ((y == 0 && x < n / 2) || (x == 0 && y < n / 2) ||
				(x == n - 1 && y > n / 2) || (y == n - 1 && x > n / 2) ||
				x == y)
				cout << "*";
			else
				cout << " ";
		}
		cout << "\n";
	}
	cout << "\n";
	///////////////////////////////////////////////////////////
	for (int y = 0; y < n; y++)
	{
		for (int x = 0; x < n; x++)
		{
			if ((y == 0 && x > n / 2) || (x == 0 && y > n / 2) ||
				(x == n - 1 && y < n / 2) || (y == n - 1 && x < n / 2) ||
				x + y == n - 1)
				cout << "*";
			else
				cout << " ";
		}
		cout << "\n";
	}
	cout << "\n";
	///////////////////////////////////////////////////////////
	for (int y = 0; y < n; y++)
	{
		for (int x = 0; x < n; x++)
		{
			if ((y == 0 && x < n) || (x == 0 && y < n) ||
				(x == n - 1 && y < n) || (y == n - 1 && x < n) ||
				x == y || x + y == n - 1)
				cout << "*";
			else
				cout << " ";
		}
		cout << "\n";
	}
	cout << "\n";
	/////////////////////////////////////////////////////////
	for (int y = 0; y < n; y++)
	{
		for (int x = 0; x < n; x++)
		{
			if ((x == 0 && y < n) || (x == n - 1 && y < n) ||
				x == y || x + y == n - 1)
				cout << "*";
			else
				cout << " ";
		}
		cout << "\n";
	}
	cout << "\n";
	/////////////////////////////////////////////////////////
	for (int y = 0; y < n; y++)
	{
		for (int x = 0; x < n; x++)
		{
			if ((y == 0 && x < n) || (y == n - 1 && x < n) ||
				x == y || x + y == n - 1)
				cout << "*";
			else
				cout << " ";
		}
		cout << "\n";
	}
	cout << "\n";
	/////////////////////////////////////////////////////////
	for (int y = 0; y < n; y++)
	{
		for (int x = 0; x < n; x++)
		{
			if ((y == 0 && x < n) || (x == 0 && y < n) ||
				(x == n - 1 && y < n) || (y == n - 1 && x < n) ||
				x == n / 2 || y == n / 2)
				cout << "*";
			else
				cout << " ";
		}
		cout << "\n";
	}
	cout << "\n";
	///////////////////////////////////////////////////////////
	for (int y = 0; y < n; y++)
	{
		for (int x = 0; x < n; x++)
		{
			if (x == y || x + y == n - 1 || (y == 0 && x + y == n / 2) ||
				(y == n - 1 && y - x == n / 2) || (x == 0 && x + y == n / 2) ||
				(x == n - 1 && x - y == n / 2))
				cout << " ";
			else if ((y == 0 && x < n / 2) || (x == 0 && y < n / 2) || (x == n / 2 && y < n / 2) || (y == n / 2 && x < n / 2) ||
				(y == n / 2 && x > n / 2) || (x == n / 2 &&  y > n / 2) || (x == n - 1 && y > n / 2) || (y == n - 1 && x > n / 2))
				cout << "*";
			else
				cout << " ";
		}
		cout << "\n";
	}
	cout << "\n";
	///////////////////////////////////////////////////////////
	for (int y = 0; y < n; y++)
	{
		for (int x = 0; x < n; x++)
		{
			if (x == y || x + y == n - 1 || (y == 0 && x + y == n / 2) ||
				(y == n - 1 && y - x == n / 2) || (x == 0 && x + y == n / 2) ||
				(x == n - 1 && x - y == n / 2))
				cout << " ";
			else if ((y == 0 && x > n / 2) || (x == 0 && y > n / 2) || (x == n / 2 && y < n / 2) || (y == n / 2 && x < n / 2) ||
				(y == n / 2 && x > n / 2) || (x == n / 2 && y > n / 2) || (x == n - 1 && y < n / 2) || (y == n - 1 && x < n / 2))
				cout << "*";
			else
				cout << " ";
		}
		cout << "\n";
	}
	cout << "\n";
}