// Ex.7
#include <iostream>
#include <cmath>
using namespace std;
int main()
{
	setlocale(0, "RUS");
	cout << " Показать на экране все числа Армстронга в диапазоне от 0 до 10.000.000.\n" << "\n";
	int n = 10000000;
	
	for (int i = 0; i < n; i++)
	{
        int icopy1 = i;
        int step = 0;
        while (icopy1 > 0) // находим степень для возведения
        {
            step++;
            icopy1 /= 10;
        }
  
        int icopy2 = i;
        int sum = 0;

        while (icopy2 > 0)
        {
            int last = icopy2 % 10; // получаем последнюю цифру числа
            sum += pow(last, step); // возводим в степень и прибавляем
            icopy2 /= 10;
        }

        if (sum == i)
        {
            cout << i << "\n";
        }
	}
}


// int a1, a2, a3, a4, a5, a6, a7; // каждая цифра числа
//if (i > 0 && i < 10)// числа от 1 до 9
//{
//	cout << i << " ";
//}
//
//if (i > 9 && i < 100)// числа от 10 до 99
//{
//	a1 = i % 10; // 2 число 
//	a2 = i / 10; // 1 число
//	if (pow(a2, 2) + pow(a1, 2) == i) cout << i << " ";
//}
//
//if (i >= 100 && i < 1000) // числа от 100 до 999
//{
//	a1 = i % 10; // 3 число
//	a2 = i % 100 / 10; // 2 число
//	a3 = i / 100; // 1 число
//	if (pow(a3, 3) + pow(a2, 3) + pow(a1, 3) == i) cout << i << " ";
//}
//if (i >= 1000 && i < 10000) // числа от 1 000 до 9 999
//{
//	a1 = i % 10; // 4 число 
//	a2 = i % 100 / 10; // 3 число
//	a3 = i % 1000 / 100; // 2 число
//	a4 = i / 1000; // 1 число
//	if (pow(a4, 4) + pow(a3, 4) + pow(a2, 4) + pow(a1, 4) == i) cout << i << " ";
//}
//if (i >= 10000 && i < 100000) // числа от 10 000 до 99 999
//{
//	a1 = i % 10; // 5 число 
//	a2 = i % 100 / 10; // 4 число
//	a3 = i % 1000 / 100; // 3 число
//	a4 = i % 10000 / 1000; // 2 число
//	a5 = i / 10000; // 1 число
//	if (pow(a5, 5) + pow(a4, 5) + pow(a3, 5) + pow(a2, 5) + pow(a1, 5) == i) cout << i << " ";
//}
//if (i >= 100000 && i < 1000000) // числа от 100 000 до 999 999
//{
//	a1 = i % 10; // 6 число 
//	a2 = i % 100 / 10; // 5 число
//	a3 = i % 1000 / 100; // 4 число
//	a4 = i % 10000 / 1000; // 3 число
//	a5 = i % 100000 / 10000; // 2 число
//	a6 = i / 100000; // 1 число
//	if (pow(a6, 6) + pow(a5, 6) + pow(a4, 6) + pow(a3, 6) + pow(a2, 6) + pow(a1, 6) == i) cout << i << " ";
//}
//if (i >= 1000000 && i < 10000000) // числа от 1 000 000 до 9 999 999
//{
//	a1 = i % 10; // 7 число 
//	a2 = i % 100 / 10; // 6 число
//	a3 = i % 1000 / 100; // 5 число
//	a4 = i % 10000 / 1000; // 4 число
//	a5 = i % 100000 / 10000; // 3 число
//	a6 = i % 1000000 / 100000; // 2 число
//	a7 = i / 1000000; // 1 число
//	if (pow(a7, 7) + pow(a6, 7) + pow(a5, 7) + pow(a4, 7) + pow(a3, 7) + pow(a2, 7) + pow(a1, 7) == i) cout << i << " ";
////}
